/*

Задание:
Создать таблицу PIVOT для стран по всем странам по всем годам 
База данных Northwind. Таблица Orders

*/

SELECT ShipCountry, [1996],[1997],[1998], [1996]+[1997]+[1998] AS Total
FROM (SELECT ShipCountry, 
             YEAR(OrderDate) AS Год,
	     OrderID
      FROM Orders) AS S
PIVOT (COUNT(OrderID) FOR Год IN ([1996],[1997],[1998])) AS PVT



-- Задачу будем решать с помощью оператора PIVOT:

-- 1. В SELECT указали наименования столбцов в итоговой таблице 
-- 2. Указываем источник с помощью подзапроса откуда будут подтягиваться данные 
-- 3. С помощью PIVOT делаем агрегацию данных по заказам для каждой страны и конкретного года 




